[
  {
    "name": "Guest It",
    "date": "Feb 2026",
    "text": "I've been learning from Ted for quite some time now. Not only is he a genuinely great person, but he's also an exceptional teacher. He built his singing ability from the ground up, which makes him especially valuable—as he understands the process deeply and brings multiple tips & tricks to solving any vocal challenge.",
    "rating": 5
  },
  {
    "name": "David V",
    "date": "Feb 2026",
    "text": "I've been working with Ted for about 6 months (virtually) because I sing in a local barbershop chorus and wanted to improve my technique and be a better chorus/quartet singer. We focus on things like building a smooth and balanced tone…",
    "rating": 5
  },
  {
    "name": "David",
    "date": "Dec 2025",
    "text": "Truly friendly and very knowledgeable.",
    "rating": 5
  },
  {
    "name": "Ellen Brock",
    "date": "Aug 2025",
    "text": "Loved my lessons with Ted, very knowledgeable and very helpful.",
    "rating": 5
  },
  {
    "name": "Helen A",
    "date": "Aug 2025",
    "text": "Ted is an incredible voice coach! He meets you exactly where you are in your vocal journey and tailors each lesson to focus on the specific areas you want to improve. He's not only supportive and encouraging, but also extremely knowledgeable. I highly recommend working with him!",
    "rating": 5
  },
  {
    "name": "Nick Trepanier",
    "date": "Apr 2025",
    "text": "I can't recommend Ted's Voice Academy highly enough. Ted is an incredible coach who brings both expertise and passion to his teaching. His ability to break down complex vocal techniques into clear, practical steps makes a huge difference…",
    "rating": 5
  },
  {
    "name": "Jamel Sebbern",
    "date": "Feb 2025",
    "text": "Ted has helped my daughter come out of her shell and helped her become top of her class in chorus. Highly recommend even if you have trouble speaking in public.",
    "rating": 5
  },
  {
    "name": "Pam Pellegrino",
    "date": "Feb 2025",
    "text": "As I have aged gracefully, my voice hasn't. I was frustrated and was very excited when I found Ted. He has been very kind and encouraging! I have experienced a difference even in the short time I have been going to him. He is always…",
    "rating": 5
  },
  {
    "name": "Jamel Sebbern",
    "date": "Feb 2025",
    "text": "Phenomenal, I have seen a huge transformation in my daughters confidence in singing from working with TED",
    "rating": 5
  },
  {
    "name": "Sandra Lee",
    "date": "Feb 2025",
    "text": "I have done some vocal coaching with Ted. It just so happened that he watched me give a 5 minute talk just prior to our appointment, so he offered excellent feedback and suggestions. If you decide to work with Ted, I highly recommend…",
    "rating": 5
  },
  {
    "name": "Dr. Trevor Marum",
    "date": "Feb 2025",
    "text": "Highly recommend for any professional needing to perfect verbal communication in person, over video or on the phone.",
    "rating": 5
  },
  {
    "name": "Tammy Standfier",
    "date": "Feb 2025",
    "text": "Before I met Ted, I had never sung in front of anyone. I was pretty nervous about starting in my late '50s, but Ted changed all of that. He's been so supportive and patient, teaching me the ins and outs of singing in a way that's easy to…",
    "rating": 5
  },
  {
    "name": "Paul Ellinger",
    "date": "Feb 2025",
    "text": "TED'S IS TOPS I've worked with literally hundreds of directors and thousands of singers and Ted's Vocal Academy is who I entrust my voice with. Ted's Vocal Academy is…",
    "rating": 5
  },
  {
    "name": "Candis Marrett",
    "date": "Feb 2025",
    "text": "Ted is the consummate professional; not only as a musician, but as a kind, non-judgemental person. He provides a safe place to explore while having a responsive and accurate sounding board that catches incorrect technique. He is most…",
    "rating": 5
  },
  {
    "name": "Randall Goodale",
    "date": "2024",
    "text": "As an individual who has under gone a plethora of career and personality testing, I found Ted's PASS profile to be very precise and well organized. It presented the findings in a very positive and helpful format that actually made me feel very empowered and having a true sense of direction for my career.",
    "rating": 5
  },
  {
    "name": "Mike Walther",
    "date": "2024",
    "text": "Ted really focuses on his clients and what his clients needs are.",
    "rating": 5
  },
  {
    "name": "Mike Hall",
    "date": "2024",
    "text": "Perceptive, clear, and creative advice. Thank you, Ted!",
    "rating": 5
  },
  {
    "name": "Christian Saether",
    "date": "2024",
    "text": "Makes great adjustments for both individual and quartet sound improvement.",
    "rating": 5
  },
  {
    "name": "Michael Sheldon",
    "date": "2024",
    "text": "My Quartet had a session with Ted and we all improved! It's exhilarating to see quick progress. Wonderful!",
    "rating": 5
  },
  {
    "name": "Gideon Shavit",
    "date": "2024",
    "text": "Ted has been incredibly helpful to my singing, both as a choral director and as a coach. He is a fantastic teacher, and has a wide array of techniques and deep knowledge. His superpower (IMHO) is the ability to tailor the coaching to each student.",
    "rating": 5
  },
  {
    "name": "Gary Ackerman",
    "date": "2024",
    "text": "I heard Ted coach several quartets. While there were certain common themes, such as space around the vowels, authentic expression, good posture and solid posts, he tailored his comments to each quartet and each singer - all within a 30…",
    "rating": 5
  },
  {
    "name": "Mindy Engelberg",
    "date": "2024",
    "text": "Ted is great and very supportive. He also always gives me the next thing to work on!",
    "rating": 5
  },
  {
    "name": "Andy Kopser",
    "date": "2024",
    "text": "Great coaching for our chorus' quartets as we prepare to send singing valentines!",
    "rating": 5
  },
  {
    "name": "Tyler Bosma",
    "date": "2024",
    "text": "We had an incredible coaching experience with Ted. He helped our quartet as an ensemble, and gave us each things to work on to improve ourselves individually. All of this from a place of kindness. It was time well spent. Thank you, Ted!!",
    "rating": 5
  },
  {
    "name": "Phil Rasch",
    "date": "2024",
    "text": "Very positive experience. Lots of constructive advice for a newbie quartet singer.",
    "rating": 5
  },
  {
    "name": "David Rice",
    "date": "2024",
    "text": "Ted brings such a breadth and depth to his quartet teaching! Very sensitive, intuitive, and intelligent he was able to help our experienced quartet with a bass new to barbershop sounding “ready for prime time” in only a 1/2 hour.",
    "rating": 5
  },
  {
    "name": "Deborah",
    "date": "2024",
    "text": "I just completed a voice session with Ted's Voice Academy. Ted is extremely knowledgeable and very patient and fun to work with. I'll definitely sign up for future sessions. Thanks Ted!",
    "rating": 5
  },
  {
    "name": "Jon Killingbeck",
    "date": "2024",
    "text": "Highly recommend his service. It is a great tool if you don't think you are reaching your true potential.",
    "rating": 5
  },
  {
    "name": "Ira Allen",
    "date": "2024",
    "text": "Ted coached our barbershop quartet (again!) a few days ago. As always, he quickly identifies, and works on, the key vocal issues that will provide the greatest improvement in our ensemble sound. Ted is definitely one of the very best vocal…",
    "rating": 5
  },
  {
    "name": "Elizabeth Davies",
    "date": "2024",
    "text": "Ted Chamberlain has been a huge influence on my work as a singer, chorus director, and contest adjudicator for the Barbershop Harmony Society. In the ten years that I have known him, I have watched him work with singers of all ages and…",
    "rating": 5
  },
  {
    "name": "Tom Kuhlmann",
    "date": "2024",
    "text": "I worked with Ted to help me achieve better control of my voice and become a better speaker.",
    "rating": 5
  }
]
